TransportManagementDevelop_KAT/Конфигурация/src/Documents/гкс_РабочаяСмена/гкс_РабочаяСмена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>гкс_РабочаяСмена</name>
  <registerRecords>InformationRegister.гкс_СостоянияОбработкиСудов</registerRecords>
  <registerRecords>InformationRegister.гкс_СостоянияФрахта</registerRecords>
  <registerRecords>AccumulationRegister.гкс_ВыработкаСмены</registerRecords>
  <registerRecords>AccumulationRegister.гкс_ОбработкаСудов</registerRecords>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводственныеСутки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Фрахт</name>
    <type>
      <types>DocumentRef.гкс_Фрахт</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОбработкаСудна</name>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Силос</name>
      <type>
        <types>CatalogRef.гкс_ТочкиМаршрута</types>
      </type>
    </attributes>
    <attributes>
      <name>Трюм</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Весы</name>
      <type>
        <types>CatalogRef.гкс_ОборудованиеПЛК</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВыгруженПолностью</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументРегистрации</name>
      <type>
        <types>DocumentRef.гкс_РегистрацияНаПЛК</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

TransportManagementDevelop_KAT/Конфигурация/src/Documents/гкс_РабочаяСмена/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
	КонецЕсли;

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	гкс_ПроведениеДокументов.ПередЗаписьюДокумента(ЭтотОбъект, РежимЗаписи, РежимПроведения);
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	гкс_ПроведениеДокументов.ПриЗаписиДокумента(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	гкс_ПроведениеДокументов.ОбработкаПроведенияДокумента(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	гкс_ПроведениеДокументов.ОбработкаУдаленияПроведенияДокумента(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	ПроверитьЗаполнениеДанныхОбработкиСудна(Отказ);
	ПроверитьПериодыРабочейСмены(Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Проверки

Процедура ПроверитьЗаполнениеДанныхОбработкиСудна(Отказ)
	
	ИменаКолонок = "НомерСтроки, ДатаОкончания, ВыгруженПолностью, Количество";
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ОбработкаСудна", ОбработкаСудна.Выгрузить(, ИменаКолонок));
	Запрос.Текст = ТекстЗапросаПроверкиЗаполненияДанныхОбработкиСудна();

	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	СтрокиОшибок = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("НомерСтроки");
	СтрокиОшибок = СтрСоединить(СтрокиОшибок, ",");
	ТекстСообщения = СтрШаблон(НСтр(
		"ru = 'В следующих строках не указана дата окончания операции!
		|N %1'"), СтрокиОшибок);
	ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
	
	ЗаписьЖурналаРегистрации(
		НСтр("ru = 'Морская логистика.Проверка заполнения'"),
		УровеньЖурналаРегистрации.Ошибка, Метаданные(), Ссылка, ТекстСообщения);
		
КонецПроцедуры

Процедура ПроверитьПериодыРабочейСмены(Отказ)
	
	// Проверить пересечение с другими сменами и не закрытые смены
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка"		, Ссылка);
	Запрос.УстановитьПараметр("Фрахт"		, Фрахт);
	Запрос.УстановитьПараметр("ДатаНачала"	, ДатаНачала);
	ТаблицыЗапроса 	= Новый Структура;
	Запрос.Текст 	= ТекстЗапросаПроверкиПериодовРабочейСмены(ТаблицыЗапроса);

	РезультатЗапроса = Запрос.ВыполнитьПакет();
	Если Не РезультатЗапроса[ТаблицыЗапроса.ПересекающиесяСмены].Пустой() Тогда 
		СтрокиОшибок = РезультатЗапроса[ТаблицыЗапроса.ПересекающиесяСмены].Выгрузить().ВыгрузитьКолонку("Ссылка");
		СтрокиОшибок = СтрСоединить(СтрокиОшибок, Символы.ПС);
		ТекстСообщения = СтрШаблон(НСтр(
			"ru = 'Обнаружено пересечение с другими сменами! Обратитесь к администратору.
			|%1'"), СтрокиОшибок);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Морская логистика.Проверка заполнения'"),
			УровеньЖурналаРегистрации.Ошибка, Метаданные(), Ссылка, ТекстСообщения);
	КонецЕсли;
		
	Если Не РезультатЗапроса[ТаблицыЗапроса.НезакрытыеСмены].Пустой() Тогда 
		СтрокиОшибок = РезультатЗапроса[ТаблицыЗапроса.НезакрытыеСмены].Выгрузить().ВыгрузитьКолонку("Ссылка");
		СтрокиОшибок = СтрСоединить(СтрокиОшибок, Символы.ПС);
		ТекстСообщения = СтрШаблон(НСтр(
			"ru = 'По Фрахту обнаружены открытые смены! Обратитесь к администратору.
			|%1'"), СтрокиОшибок);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Морская логистика.Проверка заполнения'"),
			УровеньЖурналаРегистрации.Ошибка, Метаданные(), Ссылка, ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ТекстыЗапросов

Функция ТекстЗапросаПроверкиЗаполненияДанныхОбработкиСудна()
	
	Возврат
	"ВЫБРАТЬ
	|	РабочаяСменаОбработкаСудна.НомерСтроки КАК НомерСтроки,
	|	РабочаяСменаОбработкаСудна.ДатаОкончания КАК ДатаОкончания,
	|	РабочаяСменаОбработкаСудна.Количество КАК Количество,
	|	РабочаяСменаОбработкаСудна.ВыгруженПолностью КАК ВыгруженПолностью
	|ПОМЕСТИТЬ РабочаяСменаОбработкаСудна
	|ИЗ
	|	&ОбработкаСудна КАК РабочаяСменаОбработкаСудна
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РабочаяСменаОбработкаСудна.НомерСтроки КАК НомерСтроки
	|ПОМЕСТИТЬ СтрокиВнимание
	|ИЗ
	|	РабочаяСменаОбработкаСудна КАК РабочаяСменаОбработкаСудна
	|ГДЕ
	|	РабочаяСменаОбработкаСудна.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
	|	И РабочаяСменаОбработкаСудна.ВыгруженПолностью
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РабочаяСменаОбработкаСудна.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	РабочаяСменаОбработкаСудна КАК РабочаяСменаОбработкаСудна
	|ГДЕ
	|	РабочаяСменаОбработкаСудна.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
	|	И РабочаяСменаОбработкаСудна.Количество > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтрокиВнимание.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	СтрокиВнимание КАК СтрокиВнимание
	|СГРУППИРОВАТЬ ПО
	|	СтрокиВнимание.НомерСтроки";

КонецФункции

Функция ТекстЗапросаПроверкиПериодовРабочейСмены(ТаблицыЗапроса)
	
	ТаблицыЗапроса.Вставить("ВТ_СменыФрахта", ТаблицыЗапроса.Количество());
	ТаблицыЗапроса.Вставить("ПересекающиесяСмены", ТаблицыЗапроса.Количество());
	ТаблицыЗапроса.Вставить("НезакрытыеСмены", ТаблицыЗапроса.Количество());
	
	Возврат
	"ВЫБРАТЬ
	|	ДокументРабочаяСмена.Ссылка КАК Ссылка,
	|	ДокументРабочаяСмена.ДатаНачала КАК ДатаНачала,
	|	ДокументРабочаяСмена.ДатаОкончания КАК ДатаОкончания
	|ПОМЕСТИТЬ СменыФрахта
	|ИЗ
	|	Документ.гкс_РабочаяСмена КАК ДокументРабочаяСмена
	|ГДЕ
	|	ДокументРабочаяСмена.Фрахт = &Фрахт
	|	И НЕ ДокументРабочаяСмена.ПометкаУдаления
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДатаНачала,
	|	ДатаОкончания
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПРЕДСТАВЛЕНИЕ(СменыФрахта.Ссылка) КАК Ссылка
	|ИЗ
	|	СменыФрахта КАК СменыФрахта
	|ГДЕ
	|	СменыФрахта.ДатаНачала <= &ДатаНачала
	|	И СменыФрахта.ДатаОкончания >= &ДатаНачала
	|	И НЕ СменыФрахта.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПРЕДСТАВЛЕНИЕ(СменыФрахта.Ссылка) КАК Ссылка
	|ИЗ
	|	СменыФрахта КАК СменыФрахта
	|ГДЕ
	|	СменыФрахта.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
	|	И НЕ СменыФрахта.Ссылка = &Ссылка";

КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
